[
  {
    "speaker": "user",
    "text": "Hello."
  },
  {
    "speaker": "gemini",
    "text": "Hi there, I'm Gemini, your AI interviewer. Today, we'll be diving into some machine learning concepts. I'll be asking you questions about classical machine learning, transformers, retrieval-augmented generation, a recent project you've worked on, and your past organizational experience. Feel free to ask me to repeat a question if you need to, or just let me know if you're unsure about something. Are you ready to begin?"
  },
  {
    "speaker": "user",
    "text": "Yes."
  },
  {
    "speaker": "gemini",
    "text": "Great. Let's start with classical machine learning. Can you explain the difference between supervised and unsupervised learning?"
  },
  {
    "speaker": "user",
    "text": "Okey so supervised learning uses labeled data set whereas and supervised learning uses and label data set supervised learning has algorithms like regression and classification under it whereas unsupervised learning has algorithms like clustering."
  },
  {
    "speaker": "user",
    "text": "So the difference between classicage, classification and regression is that classification aims to predict a target variable which is continuous or categorical in nature whereas real sorry not continuous but categorical whereas regression aims to predict a variable or a target which is a real value basically a number for example we can use it to estimate the price of an object or price of a particular stock whereas classification would be we can determine if possible to improve the cloud"
  },
  {
    "speaker": "gemini",
    "text": "That's a good start. Can you give me an example of a real-world problem"
  },
  {
    "speaker": "gemini",
    "text": "Okay, that's a clear explanation of the difference. Now, let's move on to transformers. Can you briefly describe the purpose of the attention mechanism in a Transformer network?"
  },
  {
    "speaker": "user",
    "text": "Okey so in a transformer the attention mechanism is basically where we try to identify or determine how much importance each input or a token has in an input sequence in order to compute the attention we require three matrices the query key and the value matrices and the attention score is calculated using the formula that is we take the soft max of the dot product of the query and the transpose of the key which is most maximum because"
  },
  {
    "speaker": "gemini",
    "text": "Thank you for the explanation. Now let's move on to Retrieval-Augmented Generation, also known as RAG. In simple terms, what is the main purpose of RAG in the context of language models?"
  },
  {
    "speaker": "user",
    "text": "Okay so basically what happen is in proprietary models are any large language model when you ask a particular question it responds based on the knowledge it has been trained on. For example but in button scenarios wherein you want a particular LLM to answer questions based on your document it may hallucinate or may not provide answers because it has not have the data in its training data. So what usually happens is much unreasonable fitting when you're"
  },
  {
    "speaker": "gemini",
    "text": "Thanks for the detailed explanation. Now, could you tell me about a recent machine learning project you worked on?"
  },
  {
    "speaker": "user",
    "text": "Okay recent machine learning project I worked on was forecasting the price of gold in my academic project so this was the project I worked on for my thesis in my master's degree so in this particular project we had to gather data for the prices of gold so the price of gold was gathered on a daily basis from website which from an Indian website and shown the code of everything else and going from where something else i would have shopsheet"
  },
  {
    "speaker": "gemini",
    "text": "Thanks. That sounds like a comprehensive project. What was your role in it?"
  },
  {
    "speaker": "user",
    "text": "So I basically are castrated the entire process starting from data collection doing statistical analysis building a model trying training it testing it out on the sample values which we had so we basically collected 12 years data and we used the past 11 years data in order to forecast the price of one year and we use it which data and we data find the current"
  },
  {
    "speaker": "gemini",
    "text": "Okay, thanks. Finally, tell me about a past internship or organizational experience that was particularly impactful for you."
  },
  {
    "speaker": "user",
    "text": "Okay, I have had multiple internships before this. So let me outline what I did in each and every one is that okay with you"
  },
  {
    "speaker": "gemini",
    "text": "Yes, please proceed."
  }
]