[
  {
    "speaker": "user",
    "text": "Hello."
  },
  {
    "speaker": "gemini",
    "text": "Hi there. I am Gemini, and I'll be conducting your interview today. We'll be covering technical questions related to machine learning, transformers, retrieval augmented generation, a recent project you've worked on, and your past organizational experience. Feel free to ask me to repeat a question if needed, or just let me know if you don't know the answer. Are you ready to begin?"
  },
  {
    "speaker": "user",
    "text": "Yes."
  },
  {
    "speaker": "gemini",
    "text": "Great. Let's start with Classical Machine Learning. Can you explain the difference between supervised and unsupervised learning?"
  },
  {
    "speaker": "user",
    "text": "सुपरवाइज लर्निंग यूयूजस लेबल डेटा लाइक क्लासिफिकेशन एंड रिग्रेशन अनसुपरवाइज यूसेस अनलेबल डेटा लाइक क्लस्टरिंग"
  },
  {
    "speaker": "gemini",
    "text": "Okay, that's a good start. Can you elaborate on some specific algorithms that fall under each category?"
  },
  {
    "speaker": "user",
    "text": "సో ఫర్ క్లాసిఫికేషన్ వి హావ్ లాజిస్టిక్ రిగ్రెషన్ అండ్ ఫర్ రిగ్రషన్ వి హావ్ లీనియర్ రిగ్రేషన్ ఫర్ క్లింగ్ వి హావ్ కే మీన్స్"
  },
  {
    "speaker": "gemini",
    "text": "Got it. Now, let's dive a bit deeper into evaluation metrics. How do you evaluate the performance of a classification model, and what are some common metrics you might use?"
  },
  {
    "speaker": "user",
    "text": "decision recall I could receive one score ready under curve."
  },
  {
    "speaker": "gemini",
    "text": "Okay, those are some good metrics. Can you explain the difference between precision and recall?"
  },
  {
    "speaker": "user",
    "text": "sure. So precision and recall are both matrix which are used to evaluate the accuracy of a classification algorithm precision measures the accuracy of positive predictions while recall measures the model ability to identify all the relevant instances."
  },
  {
    "speaker": "gemini",
    "text": "Thanks. That was helpful. In the context of imbalanced datasets, why might accuracy not be a reliable metric, and what are some alternative metrics to consider?"
  },
  {
    "speaker": "user",
    "text": "Can you can you please repeat the question?"
  },
  {
    "speaker": "gemini",
    "text": "Sure. In the context of imbalanced datasets, why might accuracy not be a reliable metric, and what are some alternative metrics to consider?"
  },
  {
    "speaker": "user",
    "text": "Okay that's a good question. So in embalance data the say we have a lot of positive instances and say there are 100 data points out of which 89 are positive and 12 are negative."
  },
  {
    "speaker": "gemini",
    "text": "Okay, continue."
  },
  {
    "speaker": "user",
    "text": "in this case the model can easily predict the positive cases but when imposed when it is posed a negative instance in the test data it might feel measurably."
  },
  {
    "speaker": "gemini",
    "text": "Okay, and what metrics could be more helpful in that case?"
  },
  {
    "speaker": "user",
    "text": "So even though the accuracy is good it might not really be a good thing because if the data set is balance then it means that it only works well for positive classes and not negative."
  },
  {
    "speaker": "gemini",
    "text": "Right. So, what are some metrics that would give you a better understanding of your model's performance on imbalanced datasets?"
  },
  {
    "speaker": "user",
    "text": "So we can use the precision and recall."
  },
  {
    "speaker": "gemini",
    "text": "Okay, good. Let's switch gears a little bit. Can you explain what regularization is and why it's used in machine learning?"
  },
  {
    "speaker": "user",
    "text": "So regularization as a technique wherein we try to penalized the models weights."
  },
  {
    "speaker": "user",
    "text": "So it is basically used to prevent overfitting in a machine learning model and there are different types of regularization like L1 L2 elastic net."
  },
  {
    "speaker": "gemini",
    "text": "Great. What are the different types of regularization techniques, and how do they differ in"
  },
  {
    "speaker": "gemini",
    "text": "Nice. Could you briefly describe how L1 and L2 regularization work and what their effects are on the model?"
  },
  {
    "speaker": "user",
    "text": "So L1 regularization basically strings the coefficients to exactly zero leading to feature selection. So if you want the model to perform feature selection as well you can go with L1 regularization whereas L2 regularization does not reduce the models coefficients to exactly zero but it does"
  },
  {
    "speaker": "user",
    "text": "use the value of the coefficient so the models performance is not significantly impacted by the irrelevant variables."
  },
  {
    "speaker": "gemini",
    "text": "Okay, that's a good explanation. How do you choose the appropriate strength of regularization,"
  },
  {
    "speaker": "gemini",
    "text": "Okay. Now, let's talk about Transformers. What are transformers primarily used for?"
  },
  {
    "speaker": "user",
    "text": "So transformers are primarily used for"
  },
  {
    "speaker": "gemini",
    "text": "Yes, go on."
  },
  {
    "speaker": "user",
    "text": "Yes so it is used for long sequences."
  },
  {
    "speaker": "gemini",
    "text": "Okay, can you give me some examples of tasks where transformers are commonly used?"
  },
  {
    "speaker": "user",
    "text": "وی یوز اٹینشن میکنس ان ارڈر ٹو"
  },
  {
    "speaker": "gemini",
    "text": "Could you provide a bit more detail? What specific applications use transformers?"
  },
  {
    "speaker": "user",
    "text": "Yes so we can use transformers for generating things"
  },
  {
    "speaker": "gemini",
    "text": "Like what?"
  },
  {
    "speaker": "user",
    "text": "Like generating images text"
  },
  {
    "speaker": "gemini",
    "text": "Okay, great. What is the attention mechanism in a Transformer, and why is it important?"
  },
  {
    "speaker": "user",
    "text": "So basically tells you how much importance you need to give to each and every token in an input sequence and we compute it by using primarily three matrices which are query key and the value matrices which are"
  },
  {
    "speaker": "user",
    "text": "వి టేక్ ద డాట్ ప్రొడక్ట్ ఆఫ్ ద క్వరీ అండ్ ద కీ"
  },
  {
    "speaker": "gemini",
    "text": "Okay, thank you. Now, let's move on to Retrieval-Augmented Generation,"
  },
  {
    "speaker": "user",
    "text": "The transpose of the key divided by the dimensions of max of that into the value vector."
  },
  {
    "speaker": "gemini",
    "text": "Okay, thank you. Now, let's move on to Retrieval"
  },
  {
    "speaker": "gemini",
    "text": "Okay, great. Now, let's move on to Retrieval-Augmented Generation, or RAG. What is the main idea behind RAG?"
  },
  {
    "speaker": "user",
    "text": "So it's an identity system where see NLM when you generally ask a query it responds with whatever information it has in the training data."
  },
  {
    "speaker": "gemini",
    "text": "Okay, and how does RAG improve upon that?"
  },
  {
    "speaker": "user",
    "text": "times it may hallucinate or sometimes it may just say which is not grounded in any truth."
  },
  {
    "speaker": "user",
    "text": "So suppose you want to query your personal document and you want LLM to answer a question based on it you can use a rag because the other LLMs are not really up to date with any information apart from the training data so if you wanted to get information based on particular documents we can use rack it has two components that favor and the generator."
  },
  {
    "speaker": "gemini",
    "text": "Okay, got it. Let'"
  },
  {
    "speaker": "gemini",
    "text": "Okay, great. Could you briefly explain the roles of the retriever and the generator in a RAG system?"
  },
  {
    "speaker": "user",
    "text": "Okay so there are tree where are trees all relevant context whereas generator uses the retrieve context and the query in order to generate a response."
  },
  {
    "speaker": "gemini",
    "text": "Okay, that makes sense. Now, let's move on to talking about a recent project that you've worked on. Can you describe a recent project you were involved in?"
  },
  {
    "speaker": "user",
    "text": "So one day some project was forecasting the price of gold."
  },
  {
    "speaker": "gemini",
    "text": "Okay, what was your role in the project, and what approach did you take?"
  },
  {
    "speaker": "user",
    "text": "So it was an into and project"
  },
  {
    "speaker": "gemini",
    "text": "And what was your role in this project?"
  },
  {
    "speaker": "user",
    "text": "बेसिकली एन एकेडमिक प्रोजेक्ट कैटेगरी"
  },
  {
    "speaker": "gemini",
    "text": "Can you elaborate on your specific role?"
  },
  {
    "speaker": "user",
    "text": "یہ سارے ڈیٹا کلیکشن موڈل بلڈنگ فائن ٹیوننگ ایویشن"
  },
  {
    "speaker": "gemini",
    "text": "Okay, and what specific techniques and tools did you use in that project?"
  },
  {
    "speaker": "user",
    "text": "So I used Python web scraping to scrape the data used transformer module and then deployed it on streamlet."
  },
  {
    "speaker": "gemini",
    "text": "Okay, and how did you evaluate the performance of your model, and what metrics did you use?"
  },
  {
    "speaker": "user",
    "text": "Since it was since it was a regression model I used means mean absolute error."
  },
  {
    "speaker": "gemini",
    "text": "What were some of the major challenges you faced during the project, and how did you address them?"
  },
  {
    "speaker": "user",
    "text": "so the main challenge was data collection."
  },
  {
    "speaker": "gemini",
    "text": "Okay, can you explain that more?"
  },
  {
    "speaker": "user",
    "text": "बिकॉज आई वांटेड टू स्टडी द इंपैक्ट ऑफ वेरियस फैक्टर्स अफेक्टिंग द प्राइस ऑफ गोल्ड आई हैड टू स्क्रप डेटा फ्रॉम मल्टीपल सोर्सेस च हैड प्राइस फॉर सिल्वर क्रूड ऑयल निफ्टी प्राइसेस पीएससी प्राइसेस एंड दे सिंस आई वाज गैदरिंग डेटा ऑन अ डेली बेसिस आई आल्सो हैड टू मेक ोर दैट द डेटा वैल्यूज फर्स्ट फॉर अदर वेरिएबल्स वेयर फॉर द सेम फ्रीक्वेंसी"
  },
  {
    "speaker": "gemini",
    "text": "Okay, that sounds challenging. Now, let's shift gears and talk about your past internship or organizational experience. Can you tell me about a prior role or organization you were a part of?"
  },
  {
    "speaker": "user",
    "text": "सो आई हैव डन सेवन इंटर्नशिप स्टिल नाउ"
  },
  {
    "speaker": "gemini",
    "text": "Okay, can you tell me about one of those internships?"
  },
  {
    "speaker": "user",
    "text": "Which one?"
  },
  {
    "speaker": "gemini",
    "text": "Choose the one that was most impactful or relevant to the field of machine learning."
  },
  {
    "speaker": "user",
    "text": "So all of them were data science internships as"
  },
  {
    "speaker": "gemini",
    "text": "Pick the most relevant one, please."
  },
  {
    "speaker": "user",
    "text": "वुड यू लाइक टू हियर अबाउट द मोस्ट रिसेंट वन"
  },
  {
    "speaker": "gemini",
    "text": "Yes, that's fine."
  },
  {
    "speaker": "user",
    "text": "ഓക്കേ മോസ്റ്റ് റീസെന്റ് വൺ വാസ് ദ ഐടി ഫോർ ചേഞ്ച്"
  },
  {
    "speaker": "gemini",
    "text": "What were your responsibilities there, and what were some of the major technical challenges you faced?"
  },
  {
    "speaker": "user",
    "text": "So I was a project in turn."
  },
  {
    "speaker": "gemini",
    "text": "And what did that entail?"
  },
  {
    "speaker": "user",
    "text": "एंड आई वाज आई वाज वर्किंग विद द एजुकेशन टीम इन ऑलरेडी टू इवैल्यूएट द रिस्पोंसेस ऑफ स्टूडेंट्स"
  },
  {
    "speaker": "gemini",
    "text": "What did you learn or what were your key takeaways from that experience?"
  },
  {
    "speaker": "user",
    "text": "So the project was basically evaluating the audios recordings of students who didn't really speak very good English so we had to evaluate the English spoken by them."
  },
  {
    "speaker": "user",
    "text": "यूज्ड विस्पिरिन विस्पिरिटेड"
  },
  {
    "speaker": "gemini",
    "text": "Okay, thank you. That's very helpful. That covers"
  },
  {
    "speaker": "gemini",
    "text": "Okay, great. Thank you. That concludes the interview."
  }
]